Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/motoring_1/driver_licensing/full_driving_licence.html.txt.tmx
Source language: en
Languages: ga

source: Applying for a driving licence
ga: Iarratas a dhéanamh ar cheadúnas tiomána

source: • Where to apply • Further information
ga: • Cá háit a ndéanfaidh mé iarratas

source: When you pass a driving test you are entitled to apply for a driving licence for the category of vehicle which you were tested for
ga: Nuair a fhaigheann tú pas i dtástáil tiomána, tá tú i dteideal iarratas a dhéanamh ar cheadúnas tiomána don chatagóir feithicle dá ndearnadh tástáil ort

source: This document explains how to apply for your driving licence after you have passed a driving test
ga: Tugtar míniú sa doiciméad seo ar conas iarratas a dhéanamh ar do cheadúnas tiomána tar éis duit pas a fháil i dtástáil tiomána

source: In other documents you will find information on:
ga: Gheobhaidh tú faisnéis i ndoiciméid eile faoi na nithe seo:

source: • Renewing your driving licence
ga: • Do cheadúnas tiomána a athnuachan

source: • Updating your driving licence or learner permit
ga: • Do cheadúnas tiomána nó do cheadúnas foghlaimeora a nuashonrú

source: • Replacing a lost, stolen or damaged driving licence or learner permit
ga: • Ceadúnas tiomána nó ceadúnas foghlaimeora a cailleadh, a goideadh nó a damáistíodh a athsholáthar

source: • Converting your driving licence to an Irish driving licence
ga: • Do cheadúnas tiomána a athrú go ceadúnas tiomána Éireannach

source: To apply for a driving licence, you must be normally resident in Ireland
ga: D’fhonn iarratas a dhéanamh ar cheadúnas tiomána, ní mór gnáthchónaí a bheith ort in Éirinn

source: You are considered to be normally resident in Ireland if, because of personal and occupational ties, you usually live here for at least 185 days in each calendar year
ga: Meastar go bhfuil gnáthchónaí ort in Éirinn má bhíonn cónaí ort anseo go hiondúil ar feadh 185 lá i ngach bliain féilire ar a laghad mar gheall ar cheangal pearsanta agus ceirde

source: You are required to carry your driving licence with you at all times when driving
ga: Ceanglaítear ort do cheadúnas tiomána a iompar leat i gcónaí agus tú ag tiomáint

source: The rules of the road are available at rulesoftheroad.ie
ga: Tá rialacha an bhóthair ar fáil ag rulesoftheroad.ie

source: The Road Safety Authority now has responsibility for driver licensing and has set up a new National Driver Licence Service (NDLS)
ga: Tá freagracht ar an Údarás um Shábháilteacht ar Bhóithre as ceadúnú tiománaithe anois agus bhunaigh sé seirbhís nua, an tSeirbhís Náisiúnta um Cheadúnais Tiomána (NDLS)

source: In addition, the application process has changed and, when applying for a driving licence, you have to visit one of the new NDLS centres
ga: De bhreis air sin, tá an próiseas iarratais athraithe anois agus ní mór duit dul chuig ceann amháin de na hionaid nua de chuid an NDLS agus iarratas á dhéanamh agat ar cheadúnas tiomána

source: As part of the face-to-face application process, your photo and your signature is captured digitally
ga: Mar chuid den phróiseas iarratais duine le duine, déantar do ghrianghraf agus do shíniú a ghabháil go digiteach

source: You have to bring additional documentation to confirm your identity
ga: Ní mór duit doiciméadúchán breise a thabhairt leat chun do chéannacht a dheimhniú

source: This is an EU initiative to introduce a secure, compact style of licence in all member states
ga: Tugadh ceadúnas tiomána cárta phlaistigh nua isteach in ionad an cheadúnais tiomána pháipéir

source: The number of driving licence categories has increased and the minimum age requirement for certain categories has changed also
ga: Is tionscnamh de chuid an AE é sin ar mhaithe le stíl shlán dhlúth cheadúnais a thabhairt isteach i ngach ballstát

source: If you obtain your first driving licence on or after 1st August 2014, you must display N-plates on your vehicle when driving for a period of 2 years
ga: Tháinig méadú ar líon na gcatagóirí ceadúnas tiomána agus tháinig athrú ar an riachtanas aoise íosta le haghaidh catagóirí áirithe freisin

source: Motorcycle riders must wear an N-tabard. The novice period only applies once
ga: Tá tuilleadh eolais ar fáil ar láithreán Gréasáin an Údaráis um Shábháilteacht ar Bhóithre

source: The penalty points disqualification threshold of 12 points is reduced to 7 penalty points for those who obtain their first learner permit on or after 1 August 2014
ga: Tá srianadh i bhfeidhm maidir le ceadúnais tiomána Chatagóir A (gluaisrothar) a eisíodh roimh an 19 Eanáir 2013

source: It remains at the lower threshold while they drive under a learner permit and subsequently during the first two years while they drive under their first driving licence
ga: Cuireann an srianadh seo teorainn leis an sealbhóir ceadúnais gluaisrothair (le carr cliathánach nó gan é) ag a bhfuil teorainn chumhachta de 25 Kw nó níos lú a thiomáint

source: The drink driving limits for drivers in their first 2 years on a full driving licence is reduced to 20mg/100ml of blood. Category A driving licences
ga: Fanann an srianadh seo i bhfeidhm ar feadh 2 bhliain ón uair a chríochnaíonn tú do thástáil tiomána gluaisrothair don chatagóir seo agus tar éis duit do láncheadúnas tiomána a fháil don chatagóir seo

source: Category A (motorcycle) driving licences issued before 19 January 2013 carry a restriction
ga: Ní bhaineann an srianadh seo le ceadúnais tiomána Chatagóir A a eisíodh ón 19 Eanáir 2013 i leith

source: This restriction limits the driving licence holder to motorcycles (with or without a sidecar) with a power limit of 25Kw or less
ga: Más rud é go sealbhaíonn tú ceadúnas tiomána chatagóir A lena mbaineann an srianadh seo agus gur mian leat an srianadh a bhaint sula mbeidh 2 bhliain caite, beidh ort modúl dul chun cinn 5 (agus modúl 1 agus modúl 3 mura ndearnadh iad cheana) d’Oiliúint Bhunúsach Tosaigh (IBT) a dhéanamh ar ghluaisrothar ag a bhfuil cumhacht os cionn 40 kW

source: This restriction continues for 2 years after you complete your motorcycle driving test for this category and after you have obtained a full driving licence for this category
ga: Tá laghdú go 20 mg/100 ml d’fhuil ar na huasteorainneacha alcóil do thiománaithe le haghaidh tiománaithe atá ina gcéad 2 bhliain ar láncheadúnas tiomána

source: This restriction does not apply to category A driving licences issued since 19 January 2013
ga: Tá tuilleadh eolais ar bhearta molta eile ar fáil ar láithreán Gréasáin an Údaráis um Shábháilteacht ar Bhóithre

source: You are entitled to apply for a driving licence if you have passed the driving test for that category of vehicle within the previous 2 years
ga: Tá tú i dteideal iarratas a dhéanamh ar cheadúnas tiomána sa chás go bhfuair tú pas sa tástáil tiomána le haghaidh na catagóire feithicle sin laistigh den 2 bhliain roimhe

source: If the Certificate of Competency you were issued with is over 2 years old, you will have to pass the driving test again
ga: Más rud é go bhfuil an Deimhniú Inniúlachta a eisíodh duit níos mó ná dhá bhliain d’aois, beidh ort pas a fháil sa tástáil tiomána an athuair

source: The period of time a driving licence is issued for depends on the age of the applicant
ga: Braitheann an tréimhse ama a n-eisítear ceadúnas tiomána ina leith ar aois an iarratasóra

source: There are 4 age brackets that the period of a licence falls under
ga: Tá 4 aoisghrúpa faoina dtiteann tréimhse an cheadúnais

source: • If you are under 60 years of age, you may apply for a 10-year licence or a 3-year (on medical grounds)
ga: • Más rud é go bhfuil tú níos lú ná 60 bliain d’aois, féadfaidh tú iarratas a dhéanamh ar cheadúnas 10 mbliana nó ar cheadúnas 3 bliana (ar fhoras míochaine)

source: • If you are older than 60 but younger than 67 years of age, you may apply for a licence that will expire the day before your 70th birthday
ga: • Más rud é go bhfuil tú níos sine ná 60 bliain d’aois ach níos óige ná 67 bliain d’aois, féadfaidh tú iarratas a dhéanamh ar cheadúnas a rachaidh in éag an lá sula sroichfidh tú 70 bliain d’aois

source: • If you are older than 67 but under 70 years of age, you may apply for a 3-year licence
ga: • Más rud é go bhfuil tú níos sine ná 67 bliain d’aois ach níos óige ná 70 bliain d’aois, féadfaidh tú iarratas a dhéanamh ar cheadúnas 3 bliana

source: • If you are over the age of 70, you will need a certification of fitness to drive from your doctor to apply for a 3-year or a one-year licence
ga: • Más rud é go bhfuil tú os cionn 70 bliain d’aois, beidh ort deimhniú oiriúnachta chun tiomána a fháil ó do dhochtúir chun iarratas a dhéanamh ar cheadúnas 3 bliana nó ar cheadúnas bliana

source: A bus or truck driving licence is issued for a maximum of 5 years
ga: Eisítear ceadúnas tiomána busanna nó trucailí le haghaidh uastréimhse 5 bliana

source: Motor vehicles are divided into different categories for driver licensing purposes
ga: Tá mótarfheithiclí roinnte i gcatagóirí éagsúla chun críocha ceadúnú tiománaithe

source: You can read more in our document on categories of vehicles and minimum ages of drivers
ga: Is féidir tuilleadh faisnéise a léamh inár ndoiciméad maidir le catagóirí feithiclí agus aoiseanna íosta tiománaithe

source: Your category of driving licence may give you entitlement to a driving licence for certain other categories of driving licence
ga: Féadfaidh catagóir do cheadúnais tiomána teidlíocht a thabhairt duit i leith ceadúnas tiomána le haghaidh catagóirí áirithe eile ceadúnas tiomána

source: See ‘Further information’ below
ga: Féach ‘Tuilleadh eolais’ thíos

source: Since January 2013, the cost of driving licences is as follows:
ga: Ó mhí Eanáir 2013, tá an costas ar cheadúnais tiomána mar seo a leanas:

source: • Ten-year driving licence costs €55
ga: • Tá €55 ar cheadúnas tiomána deich mbliana

source: • Five-year bus or truck driving licence costs €55
ga: • Tá €55 ar cheadúnas tiomána busanna nó trucailí cúig bliana

source: • Three-year driving licence costs €35
ga: • Tá €35 ar cheadúnas tiomána trí bliana

source: • One-year driving licence costs €25
ga: • Tá €25 ar cheadúnas tiomána bliana

source: Adding a new category to your current driving licence costs €35
ga: Tá €35 ar chatagóir nua a chur le do cheadúnas tiomána reatha

source: Motorists over the age of 70 can get their driving licence for free
ga: Is féidir le tiománaithe atá os cionn 70 bliain d’aois a gceadúnas tiomána a fháil saor in aisce

source: Information on acceptable forms of payment is available on the application form
ga: Tá faisnéis faoi fhoirmeacha inghlactha íocaíochta ar fáil ar an bhfoirm iarratais

source: Any required eyesight tests or medical examinations are not free of charge. How to apply You have to apply in person to one of the NDLS centres
ga: Caithfidh tú iarratas a dhéanamh go pearsanta chuig ceann amháin d’ionaid na Seirbhíse Náisiúnta um Cheadúnais Tiomána (NDLS) murar ghlac ionad de chuid an NDLS le d’iarratas ar cheadúnas tiomána nó ar cheadúnas foghlaimeora cheana féin agus murar deimhníodh do chéannacht

source: You do not have to provide photographs with your application but you do need to bring additional documents with you in order to confirm you are the person who is applying for the driving licence
ga: Ní gá duit grianghraif a chur ar fáil le d’iarratas ach ní mór duit doiciméid bhreise a thabhairt leat chun a dheimhniú gur tusa an duine atá ag déanamh iarratas ar an gceadúnas tiomána

source: If you have a learner permit or Irish driving licence, you need to bring evidence of your PPS Number and proof of address
ga: Más rud é go bhfuil ceadúnas foghlaimeora nó ceadúnas tiomána Éireannach agat, caithfidh tú fianaise ar d’Uimhir PSP agus cruthúnas ar sheoladh baile a thabhairt leat

source: If you do not have a learner permit or an Irish driving licence, you need to bring photographic ID, proof of your residency entitlement, evidence of your PPS Number and proof of address
ga: Más rud é nach bhfuil ceadúnas foghlaimeora ná ceadúnas tiomána Éireannach agat, caithfidh tú aitheantas fótagrafach, cruthúnas ar do theidlíocht chónaitheachta, fianaise ar d’Uimhir PSP agus cruthúnas ar sheoladh baile a thabhairt leat

source: See ‘Proof of identity’ below
ga: Féach ‘Cruthúnas céannachta’ thíos

source: You apply for a driving licence using the driving licence application form (D401) which is available from NDLS centres, driving test centres, driving theory test centres and Garda stations
ga: Déanann tú iarratas ar cheadúnas tiomána ach úsáid a bhaint as an bhfoirm iarratais do cheadúnas tiomána (D401) atá ar fáil ó ionaid an NDLS, ó ionaid tástála tiomána, ó ionaid tástála teoirice tiomána agus ó stáisiúin na nGardaí

source: You can also download the driving licence application form (pdf) as well as guidance notes (pdf)
ga: Is féidir freisin an fhoirm iarratais do cheadúnas tiomána (pdf) a íoslódáil mar aon le nótaí treorach (pdf)

source: Your completed application form must be accompanied by the following:
ga: Ní mór na nithe seo a leanas a bheith ag gabháil le d’fhoirm iarratais chomhlánaithe:

source: • Your current or most recently issued learner permit
ga: • Do cheadúnas foghlaimeora reatha nó is déanaí eisiúint

source: If your learner permit has been lost or stolen, the application form must be signed and stamped by a Garda in your local Garda Station
ga: Más rud é go ndearnadh do cheadúnas foghlaimeora a chailleadh nó a ghoid, caithfidh an fhoirm iarratais a bheith sínithe agus stampáilte ag Garda sa Stáisiún is gaire duit de chuid an Gharda Síochána

source: • Your current driving licence if adding a category to the driving licence
ga: • Do cheadúnas tiomána reatha más rud é go bhfuil tú ag cur catagóir le do cheadúnas tiomána

source: • A Driving Licence Medical Report Form may be required (see below)
ga: • Is féidir go mbeidh Foirm Tuairisce Míochaine um Cheadúnas Tiomána ag teastáil (féach thíos)

source: • A Driving Licence Eyesight Report Form may be required (see below)
ga: • Is féidir go mbeidh Foirm Tuairisce Radharc na Súl um Cheadúnas Tiomána ag teastáil (féach thíos)

source: • The appropriate fee - see Rates above
ga: • An táille chuí - féach Rátaí thuas

source: You will require a Driving Licence Medical Report Form if you are applying for driving licence categories C, C1, D, D1, CE, C1E, DE or D1E (buses and trucks), unless you previously provided a medical report which is still applicable
ga: Beidh Foirm Tuairisce Míochaine um Cheadúnas Tiomána ag teastáil uait más rud é go bhfuil iarratas á dhéanamh agat ar chatagóirí ceadúnas tiomána C, C1, D, D1, CE, C1E, DE nó D1E(busanna agus trucailí) murar chuir tú tuairisc mhíochaine is infheidhme fós ar fáil cheana

source: You will not require a Driving Licence Medical Report Form if you are applying for driving licence categories AM, A1, A2, A, B, BE or W (motorcycles, cars and work vehicles) unless:
ga: Ní beidh Foirm Tuairisce Míochaine um Cheadúnas Tiomána ag teastáil uait más rud é go bhfuil iarratas á dhéanamh agat ar chatagóirí ceadúnas tiomána AM, A1, A2, A, B, BE nó W (gluaisrothair, gluaisteáin agus feithiclí oibre) murar:

source: • You will be 70 years of age or more on the first day of the period for which the licence is being issued or
ga: • Go mbeidh tú 70 bliain d’aois nó níos sine ar an gcéad lá den tréimhse a bhfuil an ceadúnas á eisiúint ina leith nó

source: • You have a specific disability or condition (see application form)
ga: • Go bhfuil sain-mhíchumas ná riochta ort (féach an fhoirm iarratais)

source: You can download the medical report form (pdf) (it must be printed back to back on one page)
ga: Is féidir an fhoirm tuairisce míochaine (pdf) a íoslódáil (ní mór é a phriontáil cúl le cúl ar leathanach amháin)

source: It is also available from NDLS centres
ga: Tá sí ar fáil ó ionaid an NDLS freisin

source: A registered medical practitioner should carry out your medical examination and then complete the form
ga: Ba cheart do liachleachtóir cláraithe do scrúdú dochtúra a dhéanamh agus an fhoirm a chomhlánú ina dhiaidh sin

source: You must sign the declaration on the medical report form in the presence of the registered medical practitioner
ga: Ní mór duit an dearbhú ar an bhfoirm tuairisce míochaine a shíniú i láthair an liachleachtóra chláraithe

source: It must be submitted within 1 month
ga: Ní mór í a chur isteach laistigh de mhí amháin

source: You will require a Driving Licence Eyesight Report Form if you no longer need glasses or contact lenses
ga: Beidh Foirm Tuairisce Radharc na Súl um Cheadúnas Tiomána ag teastáil uait mura bhfuil spéaclaí ná lionsaí tadhaill de dhíth ort a thuilleadh

source: You can download the eyesight report form (pdf) (pages 1 and 2 should be printed back to back on one page)
ga: Is féidir foirm tuairisce radharc na súl (pdf) a íoslódáil (ba cheart leathanach 1 agus leathanach 2 a phriontáil cúl le cúl ar leathanach amháin)

source: It must be submitted within 1 month of completion
ga: Ní mór í a chur isteach laistigh de mhí amháin tar éis í a dhéanamh

source: The following documents are accepted as proof of your identity:
ga: Glactar leis na doiciméid seo a leanas mar chruthúnas céannachta:

source: - Current passport for all non-Irish citizens
ga: - Pas reatha le haghaidh gach saoránaigh nach as Éirinn dóibh

source: - Current national identity card for EU/EEA/Swiss citizens
ga: - Cárta aitheantais náisiúnta reatha le haghaidh shaoránaigh an AE/an LEE/na hEilvéise

source: - Current UK (photo) driving licence
ga: - Ceadúnas tiomána reatha na Ríochta Aontaithe (grianghraf)

source: - Current Public Services Card
ga: - Cárta Seirbhísí Poiblí reatha

source: - Current Irish travel document (issued by INIS)
ga: - Doiciméad taistil Éireannach reatha (arna eisiúint ag SEIÉ)

source: • Proof of your residency entitlement
ga: • Cruthúnas ar do theidlíocht chónaitheachta

source: - Irish/UK long-form birth certificate or adoption certificate
ga: - Teastas breithe fadfhoirme de chuid na hÉireann/na Ríochta Aontaithe nó teastas uchtaithe

source: - Current passport for all EU/EEA/Swiss citizens
ga: - Pas reatha le haghaidh gach saoránaigh de chuid an AE/an LEE/na hEilvéise

source: - Current Certificate of Registration (GNIB card) for non-EU/EEA/Swiss citizens
ga: - Teastas Cláraithe Reatha (cárta GNIB) le haghaidh na saoránach nach as an AE/an LEE/an Eilvéis dóibh

source: • Evidence of your PPS Number
ga: • Fianaise ar d’Uimhir PSP

source: - Public Services Card/Social Services Card
ga: - Cárta Seirbhísí Poiblí/Cárta Seirbhísí Sóisialta

source: - Correspondence from Revenue or Social Welfare showing PPSN
ga: - Comhfhreagras ó na Coimisinéirí Ioncaim nó ón Roinn Leasa Shóisialaigh lena léirítear UPSP

source: - P21/Tax Assessment/ Notice of tax credits
ga: - P21/Measúnú Cánach/Fógra faoi chreidmheasanna cánach

source: - Receipt of social welfare payment
ga: - Admháil ar íocaíocht leasa shóisialaigh

source: - Medical card/Drug Payment Scheme (DPS) Card
ga: - Cárta leighis/Cárta na Scéime Íocaíochta Drugaí (SID)

source: • Proof of address (See Note below)
ga: • Cruthúnas ar sheoladh baile (Féach an Nóta thíos)

source: - Utility bill from your electricity/phone/gas/cable television/broadband provider
ga: - Bille fóntais ó do sholáthraí leictreachais/teileafóin/gáis/teilifís chábla/leathanbhanda

source: - Correspondence with an insurance company
ga: - Comhfhreagras le cuideachta árachais

source: - Statement from your bank/building society/credit union
ga: - Ráiteas ó do bhanc/do chumann foirgníochta/do chomhar creidmheas- Litir ón Roinn Coimirce Sóisialaí nó ó na Coimisinéirí Ioncaim

source: - Other official correspondence from an Irish State agency, such as government departments; HSE; Register of Electors/polling card; CAO; Residential Tenancies Board or third-level college/training agency
ga: - Comhfhreagras oifigiúil eile ó ghníomhaireacht Stáit de chuid na hÉireann, amhail ranna rialtais; FSS; Clár na dToghthóirí/cárta vótála; an Lár-Oifig Iontrála; an Bord um Thionóntachtaí Cónaithe nó coláiste tríú leibhéal/gníomhaireacht oiliúna

source: Note: Proof of address documents can be no more than 6 months old at date of application
ga: Tabhair faoi deara: Ní fhéadann doiciméid chruthúnais ar sheoladh baile bheith níos mó ná 6 mhí d’aois ag dáta an iarratais

source: Mobile phone bills and statements from store cards/catalogue companies are not accepted
ga: Ní ghlactar le billí fón póca ná le ráitis ó chártaí siopa/ó chuideachtaí catalóige

source: You can book an appointment online
ga: Cá háit a ndéanfaidh mé iarratas

source: The National Driver Licence Service provides information on applying for a driving licence on its website. National Driver Licence Service Road Safety Authority Moyvalley Business Park Primrose Hill Ballina Co. Mayo Ireland
ga: Ba cheart iarratas ar cheadúnas tiomána a dhéanamh go pearsanta chuig ceann amháin d’ionaid na Seirbhíse Náisiúnta um Cheadúnais Tiomána (NDLS) - féach ‘Conas Iarratas a Dhéanamh’ thuas

source: Tel:0761 08 7880 Homepage: https://www.ndls.ie/
ga: Is féidir leat coinne a chur in áirithe ar líne

source: In addition, if you have held a driving licence for category B, C, C1, D, D1, BE, CE, C1E, DE or D1E since before 21 October 2006, you are entitled to a licence for category AM
ga: Cuireann an tSeirbhís Náisiúnta um Cheadúnais Tiomána faisnéis maidir le hiarratas a dhéanamh ar cheadúnas tiomána ar fáil ar a láithreán Gréasáin
